{
  "metadata": {
    "description": "Créatiion de produits digitaux en accord avec les fondamentaux de l'UX et les principes de l'Ingénierie Logicielle."
  },

  "page": {
   "about": "À propos",
   "portfolio": "Portfolio",
   "services": "Services",
   "contact": "Contact"
  },
  
  "home": {
    "designer": "Designer",
    "designerSubtitle": "Expérience Utilisateur • Interface Utilisateur • Interaction",
    "designerDescription1": "Conception de Produits Digitaux selon le processus du Design Thinking",
    "designerDescription2": "et la norme sur l'Ergonomie de l'Interaction Homme-Système",
    "designerDescription3": "(ISO 9241).",
    "designerDescription4": "Spécification -> Conception -> Évaluation",
    "engineer": "Ingénieur",
    "engineerSubtitle": "Web Réactif • Mobile Natif • Microservice",
    "engineerDescription1": "Construction de solutions logicielles selon la méthodologie Agile",
    "engineerDescription2": "et le modèle itératif du Cycle de Vie du Développement Logiciel.",
    "engineerDescription3": "Analyse -> Développement -> Test",
    "about": "À Propos",
    "aboutDescription": "Retrouvez un aperçu de mon parcours et de mes ambitions futures.",
    "portfolio": "Portfolio",
    "portfolioDescription": "Découvrez mes travaux en Design de Produit et Ingénierie Logicielle.",
    "services": "Services",
    "servicesDescription": "Découvrez mes services et tarifs en tant que Freelance ou Employé.",
    "contact": "Contact",
    "contactDescription": "Contactez-moi pour toute demande commerciale ou question."
  },

  "about": {
    "about": "À Propos",
    "aboutSubtitle1": "Je suis Sabri, un ingénieur français en développement informatique ",
    "aboutSubtitle2": "spécialisé en Interaction Homme-Machine (IHM).",
    "aboutDescription1": "Diplômé de Polytech depuis 2022 après un retour aux études, ",
    "aboutDescription2": "je travaille depuis 5 ans en tant que développeur Web et Mobile. ",
    "aboutDescription3": "Je me concentre aujourd'hui sur le design et le développement d'applications ",
    "aboutDescription4": "en tant que UX / UI Designer et ingénieur Front-end.",
    "aboutButton": "CV à jour",
    "references": "Modèles et références :",
    "skills": "Compétences :",
    "partEngineer": "Partie Ingénieur",
    "referenceEngineer1": "- Architecture Logicielle (SOLID, GRASP, LoD, Injection de Dépendances)",
    "referenceEngineer2": "- Les 23 Modèles de Conception Orientée Objet",
    "referenceEngineer3": "- Méthodologie Agile & Framework Scrum",
    "referenceEngineer4": "- Principes DevOps (TDD, CI/CD)",
    "referenceEngineer5": "- Flux de Travail Gitflow",
    "skillEngineer1": "- Documentation d'API (Swagger)",
    "skillEngineer2": "- Développement de Jeux (Unity)",
    "skillEngineer3": "- Développement de CMS Web (Shopify, Wix, Google Site)",
    "skillEngineer4": "- Déploiement sur le Cloud (GCP, AWS, Vercel)",
    "skillEngineer5": "- Développement Mobile (React Native, NativeWind, NativeBase, Realm)",
    "skillEngineer6": "- Développement Front-end (React.js, MUI, Tailwind CSS)",
    "skillEngineer7": "- Développement Back-end (Next.js, Express.js, NestJS, MongoDB, Redis)",
    "skillEngineer8": "- Intégration de services de Paiement/E-mail (Checkout, Datatrans, SendGrid, MailTrap)",
    "partDesigner": "Partie Designer",
    "referenceDesigner1": "Interaction Homme-Machine (Google Scholar, IEEE Xplore, ResearchGate) -",
    "referenceDesigner2": "ISO 9241 : Ergonomie de l'interaction homme-système -",
    "referenceDesigner3": "Ingénierie de l'Utilisabilité & Heuristiques (Nielsen) -",
    "referenceDesigner4": "Design Thinking IDEO (Kelley & Brown) -",
    "referenceDesigner5": "Protection de la Vie Privée dès la Conception (Cavoukian) -",
    "skillDesigner1": "Développement de Personas / Flux Utilisateur -",
    "skillDesigner2": "Entretiens de recherche semi-structurés -",
    "skillDesigner3": "Évaluation de l'Utilisabilité du Système (SUS) -",
    "skillDesigner4": "État de l'Art de la Conception d'Interaction (SOTA) -",
    "skillDesigner5": "Montage Vidéo (Adobe Premiere Pro / After Effect) -",
    "skillDesigner6": "Illustrations en graphiques vectoriels (Adobe Illustrator) -",
    "skillDesigner7": "Wireframes, Maquettes & Prototypes (Adobe XD, Figma, Sketch) -",
    "skillDesigner8": "Modélisation 3D (Blender, Adobe Substance Painter, Marvelous Designer) -",
    "randomFacts": "Faits Divers",
    "randomFactsSubtitle": "Quelques informations exclusives...",
    "randomFact1": "Ce site web a été codé de zéro de manière responsive !",
    "randomFact2": "Je suis fan de l'Univers Cinématographique Marvel.",
    "randomFact3": "J'ai un talent inné pour les Arts Martiaux.",
    "randomFact4": "Ma personnalité est rare (INFJ-T).",
    "randomFact5": "Je suis accro aux tacos.",
    "myStory": "Mon Histoire",
    "myStorySubtitle": "Permettez-moi de vous présenter ma vie.",
    "myStoryDescription1": "Découvrez comment je suis passé d'agent de sécurité à ingénieur en logiciel.",
    "myStoryButton": "Découvrir"
  },

  "portfolio": {
    "all": "Tout",
    "comingSoon": "À venir...",
    "projects": "Projets",
    "project": "Projet",
    "insights": "Perspectives",
    "independentResearch": "Recherche Indépendante",
    "creativeConcepts": "Concepts Créatifs",
    "caseStudies": "Études de Cas",
    "uxUiDesign": "Design UX / UI ",
    "3dDesign": "Design 2D / 3D",
    "webDevelopment": "Dev Web",
    "mobileDevelopment": "Dev Mobile",
    "desktopDevelopment": "Dev Logiciel", 
    "projectDescriptionKoraebi": "This portfolio website made from scratch !",
    "projectDescriptionSpidermaps": "Appreciation des cryptomonnaies par visualisation en diagramme de Kiviat.",
    "projectDescriptionCoinify": "Intégration des paiements en cryptomonnaie avec Coinify pour Smood.ch.",
    "projectDescriptionTogethere": "Prototypage hi-fi d'une application mobile pour un business plan.",
    "projectDescriptionScrumtable": "Solution ubiquitaire interactive  pour table, écran, smartphone et tablette.",
    "projectDescriptionMoon2Bmt": "Dev rapide de 3h pour la simulation de migration du token de Bubblemaps."
  },

  "story": {
    "returnButton": "Retour",
    "background": "Contexte",
    "backgroundStory": "J'ai obtenu mon diplôme d'études secondaires en Marketing en 2013. Étant une personne très autonome, j'ai cherché activement des opportunités pour entrer rapidement dans le monde professionnel. J'ai donc rejoint l'industrie de la sécurité privée où j'ai évolué pendant plus de quatre ans. Porté par l'ambition, je suis passé de gardien de sécurité à technicien en sécurité incendie, pour finalement devenir instructeur en sécurité privée. Animé par une curiosité naturelle, j'ai exploré différents domaines de la sécurité et me suis intéressé à la Protection des données, à la Cybersécurité et, enfin, à l'Informatique. Après avoir réévalué ma carrière, j'ai décidé de retourner à l'école pour en apprendre davantage sur les réseaux informatiques et le développement de logiciels.",
    "milestones": "Études",
    "milestone1": "En tant qu'adulte retournant à l'université, j'ai surmonté des défis considérables pour obtenir mes diplômes. J'ai obtenu avec succès un BTS en Informatique, ainsi qu'une licence professionnelle en Développement d'Applications Mobiles, respectivement en 2019 et 2020.",
    "milestone2": "Animé par ma passion pour l'ingénierie, j'ai poursuivi un Master en Informatique à l'Université Côte d'Azur, en surpassant des cours exigeants de mathématiques appliquées à l'informatique. Durant cette période, j'ai découvert un aspect captivant des ordinateurs.",
    "milestone3": "Poursuivant mon parcours académique, j'ai obtenu mon diplôme de Polytech en 2022, avec une spécialisation en Ingénierie Informatique et une mineure en Interaction Homme-Machine (IHM). Cela m'a permis de découvrir le domaine fascinant du Design d'Interaction et du processus de Conception Centrée sur l'Utilisateur (CCU), en intégrant des disciplines telles que la Psychologie Cognitive, l'Ergonomie, l'Utilisabilité et l'Expérience Utilisateur, associées au Développement Front-end.",
    "milestone4": "Cette exploration a stimulé ma créativité et m'a permis une croissance personnelle significative grâce au développement de projets. Cette nouvelle passion me pousse toujours vers l'avant.",
    "aspirations": "Carrière",
    "aspiration1": "Grâce à ma participation à un programme d'apprentissage en parallèle de mes études, j'ai acquis une précieuse expérience professionnelle. J'ai travaillé pendant un an en tant que développeur Mobile et pendant deux ans en tant que développeur Full Stack Web au sein d'une entreprise axée sur les produits, en suivant un cycle de vie Agile de développement logiciel.",
    "aspiration2": "Faisant preuve d'un fort sens de l'autonomie, j'ai réussi à mener plusieurs projets pendant cette période. Des exemples notables incluent l'intégration de paiements en crypto-monnaie avec Coinify et Datatrans, ainsi que la mise en place d'une approche State-of-the-Art (SOTA) dans les méthodes de conception centrée sur l'utilisateur pour améliorer l'utilisabilité des API. Pour plus de détails, veuillez consulter mon CV.",
    "aspiration3": "En envisageant l'avenir, je suis enthousiaste à l'idée de relever de nouveaux défis. Ma compétence en ingénierie du développement de logiciels, combinée à mon expertise en Interaction Homme-Machine et en Conception Centrée sur l'Utilisateur, fait de moi un atout précieux pour tout projet numérique."
  },

  "contact": {
    "contact": "Contact",
    "contactSubtitle": "N'hésitez pas à me contacter pour toute demande commerciale ou question concernant mon travail.",
    "contactDescription1": "Que vous ayez besoin de support ou que vous souhaitiez explorer une opportunité commerciale, je vous invite à remplir le formulaire avec le sujet approprié.",
    "contactDescription2": "Je vous répondrai rapidement.",
    "email": "Email",
    "name": "Nom",
    "subject": "Objet",
    "submit": "Envoyer",
    "submitted": "Envoyé !",
    "error": "Désolé, une erreur s'est produite. Veuillez contacter directement cette adresse e-mail : contact@koraebi.com",
    "message": "Message"
  },

  "services": {
    "location": "Emplacement:",
    "uxDesigner": "UX / UI DESIGN",
    "frontendDeveloper": "DEV WEB FRONT-END",
    "backendDeveloper": "DEV WEB BACK-END",
    "fullStackDeveloper": "DEV WEB FULL-STACK",
    "mobileDeveloper": "DEV MOBILE",
    "desktopDeveloper": "DEV LOGICIEL",
    "services": "Services",
    "freelance": "Freelance",
    "employee": "Employé",
    "shortTerm": "Court Terme",
    "longTerm": "Long Terme",
    "year": "an",
    "day": "jour",
    "month": "mois",
    "remoteOnly": "Full-remote seulement",
    "onSiteOrRemote": "Sur site ou en full-remote",
    "france": "FRANCE",
    "switzerland": "SUISSE",
    "dubai": "DUBAI",
    "proficiencies": "Compétences :",
    "contact": "Contacter"
  }
}