{
  "home": {
    "about": "About",
    "aboutDescription": "Find my latest resume and an overview of my story.",
    "portfolio": "Portfolio",
    "portfolioDescription": "Take a look at my work in Product Design and Software Engineering.",
    "services": "Services",
    "servicesDescription": "Discover my tech services and pricing strategies.", 
    "contact": "Contact",
    "contactDescription": "Reach me out for for any business inquiries or questions."
  },

  "about": {
    "about": "About",
    "aboutSubtitle1": "I'm a french Software Development Engineer ",
    "aboutSubtitle2": "specialized in Human-Computer Interaction.",
    "aboutDescription1": "Graduated since 2022 after an academic come back, ",
    "aboutDescription2": "I have been working in the software industry for 4 years ",
    "aboutDescription3": "as a Web and Mobile developer. Additionally, I am currently ",
    "aboutDescription4": "taking my first steps into the design industry as a UX Designer.",
    "aboutButton": "Resume",
    "references": "Models and references:",
    "skills": "Skills:",
    "partEngineer": "Part Engineer",
    "referenceEngineer1": "- Software Architecture principles (SOLID, GRASP, LoD, Dependency Injection)",
    "referenceEngineer2": "- The 23 Object-Oriented Programming Design Patterns",
    "referenceEngineer3": "- Agile Methodology & Scrum Framework",
    "referenceEngineer4": "- DevOps principles (TDD, CI/CD)",
    "referenceEngineer5": "- Gitflow Workflow",
    "skillEngineer1": "- API Documentation (Swagger)",
    "skillEngineer2": "- Game Development (Unity, Vuforia)",
    "skillEngineer3": "- Web CMS Development (Shopify, Wix)",
    "skillEngineer4": "- Cloud Deployment (GCP, Docker, Kubernetes)",
    "skillEngineer5": "- Payment Service integration (Checkout, Datatrans)",
    "skillEngineer6": "- Mobile Development (React Native, NativeWind, Xamarin)",
    "skillEngineer7": "- Front-end Development (React.js, Next.js, Angular, Tailwind)",
    "skillEngineer8": "- Back-end Development (Node.js, Sails.js, NestJS, MongoDB, Redis)",
    "partDesigner": "Part Designer",
    "referenceDesigner1": "- Human-Computer Interaction (Google Scholar, IEEE Xplore, ResearchGate)",
    "referenceDesigner2": "- ISO 9241: Ergonomics of human-system interaction",
    "referenceDesigner3": "- Usability Engineering & Heuristics (Nielsen)",
    "referenceDesigner4": "- IDEO Design Thinking (Kelley & Brown)",
    "referenceDesigner5": "- Privacy by Design (Cavoukian)",
    "skillDesigner1": "- Persona / User Flow development",
    "skillDesigner2": "- Semi-Structured research interviews",
    "skillDesigner3": "- System Usability Scale (SUS) inquiries",
    "skillDesigner4": "- Interaction Design State of the Arts (SOTA)",
    "skillDesigner5": "- Vector Graphics illustrations (Adobe Illustrator)",
    "skillDesigner6": "- Video Editing (Adobe Premiere Pro / After Effect)",
    "skillDesigner7": "- Wireframes, Mock-ups & Prototypes (Adobe XD / Figma, Sketch)",
    "skillDesigner8": "- 3D Modeling (Blender, Adobe Substance Painter, Marvelous Designer)",
    "randomFacts": "Random Facts",
    "randomFactsSubtitle": "Some exclusive information...",
    "randomFact1": "This website was coded from scratch with responsiveness!",
    "randomFact2": "I'm a fan of the Marvel Cinematic Universe.",
    "randomFact3": "I have an innate talent for Martial Arts.",
    "randomFact4": "My personality is rare (INFJ-T).",
    "randomFact5": "I'm a french tacos addict.",
    "myStory": "My Story",
    "myStorySubtitle": "Let me introduce you to my life.",
    "myStoryDescription1": "Discover how I went from security officer to software engineer. ",
    "myStoryDescription2": "Take a look at some of my university projects.",
    "myStoryButton": "Discover"
  },

  "portfolio": {
    "projects": "Projets",
    "insights": "Perspectives",
    "independentResearch": "Recherche Independante",
    "creativeConcepts": "Concepts Créatifs",
    "caseStudies": "Etudes de Cas",
    "discovery": "Découverte",
    "uxUiDesign": "UX/UI Design",
    "webDevelopment": "Développement Web",
    "mobileDevelopment": "Développement Mobile",
    "apiDevelopment": "Développement API",
    "gameDevelopment": "Développement Jeu Vidéo"
  },

  "story": {
    "returnButton": "Back",
    "background": "Background",
    "backgroundStory": "I graduated with a high school diploma in Marketing in 2013. Being a highly self-reliant individual, I actively sought opportunities to swiftly enter the professional sphere. Consequently, I ventured into the private security industry where I honed my skills for over four years. Driven by ambition, I progressed from a security guard to a fireguard technician and eventually attained the position of a private security instructor. Displaying an innate curiosity, I delved into diverse security domains and developed a keen interest in Privacy, Cyber Security, and, ultimately, Computer Science. Following a careful evaluation of my career trajectory, I made the decision to pursue further education and enhance my knowledge in computer networks and software development.",
    "milestones": "Milestones",
    "milestone1": "As an adult returning to academia, I overcame significant challenges to earn an Associate degree in Computing & Software Development and a Bachelor of Applied Science degree in Mobile Application Development in 2019 and 2020, respectively.",
    "milestone2": "Driven by my passion for engineering, I pursued a Master's degree in Computer Science at Côte d'Azur University, surpassing demanding computer mathematics courses. During this time, I discovered a captivating and humbling aspect of computers.",
    "milestone3": "Continuing my academic journey, I graduated from Polytech in 2022, majoring in Computer Engineering with a minor in Human-Computer Interaction (HCI). This exposed me to the fascinating realm of Interaction Design and User-Centered Design (UCD) process, incorporating Cognitive Psychology, Ergonomics, Usability, and User Experience, alongside Front-end Engineering.",
    "milestone4": "My exploration in these areas ignited my creativity and led to significant personal growth through the development of projects. This newfound passion drives me forward.",
    "aspirations": "Future Aspirations",
    "aspiration1": "Thanks to my participation in an apprenticeship program alongside my studies, I gained valuable professional experience. I served as a Mobile Developer for one year and as a Web Full Stack Developer for two years in a product-oriented company that adhered to an Agile Software Development Life Cycle (SDLC).",
    "aspiration2": "Demonstrating a strong sense of autonomy, I successfully led multiple projects during this time. Noteworthy examples include the integration of Crypto Payments with Coinify and Datatrans, as well as the initiation of a State-of-the-Art (SOTA) approach in User-Centered Design Methods to improve API Usability. For further details, please refer to my resume.",
    "aspiration3": "As I look towards the future, I am eager to embrace new challenges. My engineering proficiency in Software Development, complemented by my expertise in Human-Computer Interaction and User-Centered Design, positions me as a valuable asset for any digital project."
  },

  "contact": {
    "contact": "Contact",
    "contactSubtitle": "Reach me out for for any business inquiries or questions regarding my work.",
    "contactDescription1": "Whether you need support or have a business opportunity you'd like to explore, I invite you to fill the subject form properly.",
    "contactDescription2": "I'll get back to you promptly.",
    "email": "Email",
    "name": "Nom",
    "subject": "Objet",
    "submit": "Transmettre",
    "submitted": "Envoyé !",
    "error": "Sorry something went wrong, please contact this email address directly: contact@koraebi.com",
    "message": "Message"
  },

  "services": {
    "comingSoon": "Coming Soon..."
  }
}